# BuiltInFailures.ColumnFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnFailures Class
BuiltInFailures Class Members See Also
---
Failures about Columns.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ColumnFailures
```

Visual Basic
---
```text
Public NotInheritable Class ColumnFailures
```

Visual C++
---
```text
public ref class ColumnFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ColumnFailures
# See Also
BuiltInFailures..::..ColumnFailures Members
Autodesk.Revit.DB Namespace